Revit 2024 API
PipeInsulation Class
 Represents insulation applied to the outside of a given pipe, fitting or content.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class PipeInsulation : InsulationLiningBase
Visual Basic
Public Class PipeInsulation _
	Inherits InsulationLiningBase
Visual C++
public ref class PipeInsulation : public InsulationLiningBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Plumbing.PipeInsulation
See Also
PipeInsulation Members
Autodesk.Revit.DB.Plumbing Namespace